import { IFAQ } from "@/types";

export const faqs: IFAQ[] = [
    {
        question: 'ปั๊มน้ำ EIFEL ใช้มอเตอร์อะไร?',
        answer: 'เราใช้มอเตอร์คุณภาพสูงจากเยอรมนี ทุกรุ่นผ่านมาตรฐาน CE และ ISO มอเตอร์ประหยัดไฟ Efficiency Class IE3 ทนทานใช้งานได้นาน พร้อมระบบป้องกันเกินภาระ',
    },
    {
        question: 'การรับประกันเป็นอย่างไร?',
        answer: 'ปั๊มน้ำทุกรุ่นมีการรับประกัน 3 ปีเต็ม (Industrial Series รับประกัน 5 ปี) ครอบคลุมความเสียหายจากการผลิตและการใช้งานปกติ พร้อมศูนย์บริการและอะไหล่แท้ทั่วประเทศ',
    },
    {
        question: 'มีบริการติดตั้งไหม?',
        answer: 'มีครับ เรามีทีมช่างผู้เชี่ยวชาญให้บริการติดตั้งทั่วประเทศ รวมถึงการตรวจสอบระบบไฟฟ้า การต่อท่อ และการทดสอบการทำงาน บริการติดตั้งฟรีสำหรับปั๊มรุ่น Industrial Series'
    },
    {
        question: 'สามารถผ่อนชำระได้ไหม?',
        answer: 'ได้ครับ เรามีบริการผ่อน 0% นาน 12 เดือน สำหรับบัตรเครดิตทุกธนาคาร หรือสามารถผ่อนผ่าน Kredivo และ Atome ได้ รองรับการสั่งซื้อออนไลน์และหน้าร้าน',
    },
    {
        question: 'หากต้องการซ่อมหรือบำรุงรักษาทำอย่างไร?',
        answer: 'สามารถติดต่อศูนย์บริการ EIFEL ทั่วประเทศ หรือโทรเรียกช่างถึงหน้างาน บริการตรวจเช็คและบำรุงรักษาฟรีทุก 6 เดือน พร้อมอะไหล่แท้และการรับประกันงานซ่อม'
    }
];