import { IFAQ } from "@/types";

export const faqs: IFAQ[] = [
    {
        question: 'นาฬิกา WISE Watch ใช้เครื่องจักรอะไร?',
        answer: 'เราใช้เครื่องจักรคุณภาพสูงจากสวิตเซอร์แลนด์และญี่ปุ่น ขึ้นอยู่กับรุ่น Classic Series ใช้เครื่องจักรควอทซ์ญี่ปุ่น ส่วน Royal Series และ Limited Edition ใช้เครื่องจักรออโตเมติกสวิสแท้',
    },
    {
        question: 'การรับประกันเป็นอย่างไร?',
        answer: 'นาฬิกาทุกเรือนมีการรับประกัน 2 ปีเต็ม (Limited Edition รับประกัน 3 ปี) ครอบคลุมความเสียหายจากการผลิตและการใช้งานปกติ พร้อมศูนย์บริการทั่วประเทศ',
    },
    {
        question: 'มีร้านค้าที่ไหนได้บ้าง?',
        answer: 'เรามีตัวแทนจำหน่ายใน ห้างสรรพสินค้าชั้นนำทั่วประเทศ รวมถึงร้าน WISE Watch Store ในกรุงเทพฯ เชียงใหม่ ขอนแก่น และหาดใหญ่ สามารถสั่งซื้อออนไลน์ผ่าน Facebook และ Line ได้'
    },
    {
        question: 'สามารถผ่อนชำระได้ไหม?',
        answer: 'ได้ครับ เรามีบริการผ่อน 0% นาน 10 เดือน สำหรับบัตรเครดิตทุกธนาคาร หรือสามารถผ่อนผ่าน ShopBack Paylater และ Atome ได้',
    },
    {
        question: 'หากต้องการซ่อมหรือบำรุงรักษาทำอย่างไร?',
        answer: 'สามารถนำมาที่ศูนย์บริการ WISE Watch ทั่วประเทศ หรือติดต่อทีมบริการลูกค้าเพื่อจัดส่งซ่อมถึงบ้าน บริการทำความสะอาดและตรวจเช็คฟรีทุก 6 เดือน'
    }
];