import { IPricing } from "@/types";

export const tiers: IPricing[] = [
    {
        name: 'Classic Series',
        price: '4,990',
        features: [
            'เครื่องจักรควอทซ์ญี่ปุ่น',
            'กระจกมิเนอรัลคุณภาพสูง',
            'สายหนังแท้อิตาลี',
            'กันน้ำ 50 เมตร',
            'รับประกัน 2 ปี',
        ],
    },
    {
        name: 'Royal Series',
        price: '8,990',
        features: [
            'เครื่องจักรออโตเมติกสวิส',
            'กระจกแซฟไฟร์กันขีดข่วน',
            'ตัวเรือนสแตนเลสสตีล 316L',
            'สายโซ่สแตนเลสสตีล',
            'กันน้ำ 100 เมตร',
            'หน้าปัดลวดลายไทย',
            'รับประกัน 2 ปี',
        ],
    },
    {
        name: 'Limited Edition',
        price: '15,990',
        features: [
            'เครื่องจักรออโตเมติกสวิสแท้',
            'ตัวเรือนทองคำ 18K',
            'กระจกแซฟไฟร์โดม',
            'สายหนังจระเข้แท้',
            'กันน้ำ 200 เมตร',
            'ลวดลายไทยทองแท้',
            'ผลิตจำกัด 100 เรือน',
            'รับประกัน 3 ปี',
            'บริการส่วนตัวเฉพาะ',
        ],
    },
]